from matplotlib.pylab import *
from sympy import *
from sympy.matrices import Matrix





Ξ  = S("Ξ")
ζ  = S("ζ")
ξ  = S("ξ")
η  = S("η")




x0  = S("x0")
x0  = S("x0")

# x = x0*((Ξ - 1 )*(ζ - 1) * Ξ * ζ   / 4)    + x1*((Ξ + 1 )*(ζ - 1) * Ξ * ζ   / 4)  + x2*((Ξ + 1 )*(ζ + 1) * Ξ * ζ   / 4) + x3*((Ξ - 1 )*(ζ + 1) * Ξ * ζ   / 4) + x4*((1 - Ξ**2 )*(ζ - 1) * ζ / 2) + x5*((1 - ζ**2 )*(Ξ + 1) * Ξ / 2) + x6*((1 - Ξ**2 )*(ζ + 1) * ζ / 2) + x7*((1 - ζ**2 )*(Ξ - 1) * Ξ / 2) + x8*((1 - ζ**2 )*(1 - Ξ**2 ))     
# y = y0*((Ξ - 1 )*(ζ - 1) * Ξ * ζ   / 4)    + y1*((Ξ + 1 )*(ζ - 1) * Ξ * ζ   / 4)  + y2*((Ξ + 1 )*(ζ + 1) * Ξ * ζ   / 4) + y3*((Ξ - 1 )*(ζ + 1) * Ξ * ζ   / 4) + y4*((1 - Ξ**2 )*(ζ - 1) * ζ / 2) + y5*((1 - ζ**2 )*(Ξ + 1) * Ξ / 2) + y6*((1 - Ξ**2 )*(ζ + 1) * ζ / 2) + y7*((1 - ζ**2 )*(Ξ - 1) * Ξ / 2) + y8*((1 - ζ**2 )*(1 - Ξ**2 ))    
        


# """

#   Ξ 
#   ξ
#   η
#   ζ

# """


N0 = (Ξ - 1 )*(ζ - 1) * Ξ * ζ   / 4
N1 = (Ξ + 1 )*(ζ - 1) * Ξ * ζ   / 4
N2 = (Ξ + 1 )*(ζ + 1) * Ξ * ζ   / 4
N3 = (Ξ - 1 )*(ζ + 1) * Ξ * ζ   / 4
N4 = (1 - Ξ**2 )*(ζ - 1) * ζ / 2
N5 = (1 - ζ**2 )*(Ξ + 1) * Ξ / 2
N6 = (1 - Ξ**2 )*(ζ + 1) * ζ / 2
N7 = (1 - ζ**2 )*(Ξ - 1) * Ξ / 2
N8 = (1 - ζ**2 )*(1 - Ξ**2 )





dN0_dΞ = N0.diff(Ξ,1)
dN0_dζ = N0.diff(ζ,1)

dN1_dΞ = N1.diff(Ξ,1)
dN1_dζ = N1.diff(ζ,1)

dN2_dΞ = N2.diff(Ξ,1)
dN2_dζ = N2.diff(ζ,1)

dN3_dΞ = N3.diff(Ξ,1)
dN3_dζ = N3.diff(ζ,1)

dN4_dΞ = N4.diff(Ξ,1)
dN4_dζ = N4.diff(ζ,1)

dN5_dΞ = N5.diff(Ξ,1)
dN5_dζ = N5.diff(ζ,1)

dN6_dΞ = N6.diff(Ξ,1)
dN6_dζ = N6.diff(ζ,1)

dN7_dΞ = N7.diff(Ξ,1)
dN7_dζ = N7.diff(ζ,1)

dN8_dΞ = N8.diff(Ξ,1)
dN8_dζ = N8.diff(ζ,1)

¡






# # fig = figure()
# # ax = axes(projection="3d")
# # ax.plot_surface(Ξ,ζ,N8)
# # show()





